---
kind: other
id: Properties.T:Autodesk.Revit.ApplicationServices.Application
source: html/fbcb6022-fd2f-db92-333a-308163cb4f92.htm
---
# Application Properties

Retrieves the Id of the currently running external application.